#include <iostream>
using namespace std;

int main() {
	const int a = 1000;
	int n, k, c = 0, e = 0, m;
	cin >> n;
	int s[a];

	for (int i = 0; i < n; i++) { // ввод массива 
		cin >> s[i];
	}

	for (int i = 0; i < n; i++) { // проход по символам массива
		k = 1;
		while (s[i] == s[i + 1]) { // поиск повтор€ющихс€ последовательностей 
			k++;
			i++;
		}
		if (k >= 3) { // поиск повтор€ющихс€ последовательностей больше 3 символов
			for (int x = i - k + 1; x <= i; x++) {	// замена последовательности на -1
				s[x] = -1;
			}
			k = 1;
		}
	}
	k = 1;
	for (int i = 0; i < n; i++) {
		if (s[i] == s[i + 1 + e] && (s[i + 2] == -1 || s[i-1+e] == -1)) {
			m = i;
			while (s[m+2]==-1) {	// подсчет количества -1
				e++;
				m++;
			}
			k++;
			if (k >= 3) { // поиск повтор€ющихс€ последовательностей больше 3 символов
				for (int x = k + e - 1; x <=i ; x++) {	// замена последовательности на -1
					s[x] = -1;
				}
				k = 1;
			}
			
		}
	}


	for (int i = 0; i < n; i++) { // подсчет удаленных символов
		if (s[i] == -1) {
			c++;
		}
	}
	cout << c << '\n'; // вывод количества удаленных шариков

	for (int i = 0; i < n; i++) { // test 
		cout << s[i] << ' ';
	}
	return 0;
}