#include <iostream>
using namespace std;

int main(){
    int coutn = 0, max =0;
    for (int i = 2461; i <= 9719; i++){
        if ((((i / 10) % 10) >= 3 && ((i / 10) % 10) <= 7) && (((i / 100) % 10) != 1 && ((i / 100) % 10) != 9)){
            coutn++; 
            max = i;
        } 
    }
    
    cout << coutn << '\n' << max << '\n';
    return 0;
}
/*
Рассматривается множество целых чисел, принадлежащих числовому отрезку [2461; 9719], которые удовлетворяют следующим условиям:
− цифра в разряде десятков принадлежит отрезку [3; 7];
− цифра в разряде сотен отлична от 1 и 9.
Найдите количество таких чисел и максимальное из них.
*/