#include <iostream>
#include <fstream>
using namespace std;

int main()
{
    fstream file ("Urakova.prn");
    int a[1000], i = 0, count = 0;

    while (file){
        file >> a[i];
        i++;
    }

    for (int i = 0; i < 999; i++){
        for (int j = i + 1; j < 1000; j++){
            if (j - i >= 7 && (a[i] + a[j] >= 1500 && a[i] + a[j] <= 2000)){
                count++;
            }
        }
    }

    cout << count << endl;
    return 0;
}

/*
Дана последовательность натуральных чисел.
Рассматриваются всевозможные пары чисел, порядковые номера которых
отличаются не менее чем на 7. Определите количество таких пар, для которых
сумма чисел находится в диапазоне от 1500 до 2000, включая 1500 и 2000.
Исходные данные записаны в виде столбца электронной таблицы в файле 18-
k3.xls.
*/
