#include <iostream>
using namespace std;

int main(){
    int sum = 0, min = 0;
    for (int i = 10; i <= 1178; i++){
        int odn, dv;
        if (i % 2 == 0){
            odn = i % 10;
            dv = i % 100;
            if (odn != 0 && odn != 2 && odn != 6 && odn != 8 && dv != 14){
                if (min == 0){
                    min = i;
                }
                sum += i;
            }
        }
    }
    cout << min << '\n' << sum << '\n';
    return 0;
}
/*
Рассматривается множество четных целых чисел, принадлежащих числовому отрезку [10; 1178], 
которые не оканчиваются на 0, 2, 6, 8, 14 в десятичной записи. Найдите сумму таких чисел и 
минимальное из них. 
В ответе запишите два целых числа: сначала сумму, затем минимальное число.      
*/