#include <iostream>
using namespace std;

int main(){
    int count = 0, max = 0;
    for (int i = 4563; i <= 7912; i++){
        if (i % 7 == 0){
            int ml, st;
            ml = i % 10;
            int x = i;
            while (x > 0){
                st = x % 10;
                x /= 10;
            }
            if (st + ml > 10){
                count++;
                max = i;
            }
        }
    }
    cout << count << '\n' << max;
    return 0;
}
/*
Рассматривается множество целых чисел, принадлежащих числовому отрезку [4563; 7912], 
которые удовлетворяют следующим условиям: а) число кратно 7; 
б) сумма старшего и младшего разрядов больше 10. 
Найдите наибольшее из таких чисел и их количество.      
*/