#include <iostream>
using namespace std;

int main(){
    int count = 0, max = 0;
    for (int i = 4096; i <= 9081; i++){
        if (i % 7 == 1 || i % 7 == 5){
            count++;
            max = i;
        } 
    }
    cout << count << '\n' << max << '\n';
    return 0;
}
/*
Рассматривается множество целых чисел, принадлежащих числовому отрезку [3466; 9081], которые удовлетворяют следующим условиям:
− количество цифр в восьмеричной и десятичной записях числа не совпадает;
− остаток от деления на 7 равен 1 или 5.
Найдите количество таких чисел и максимальное из них.
        
*/