#include <iostream>
#include <vector>
using namespace std;

int main(){
    vector <int> f (14, 0);
    f[2] = 1;
    for (int i = 3; i<= 10; i++){
        if (i - 1 >= 2){
            f[i] += f[i - 1];
        }
        if (i - 2 >= 2){
            f[i] += f[i - 2];
        }
        if ((i / 3 >= 2) && (i % 3 == 0)){
            f[i] += f[i / 3];
        }
    }
    for (int i = 11; i<= 13; i++){
        if (i - 1 >= 10){
            f[i] += f[i - 1];
        }
        if (i - 2 >= 10){
            f[i] += f[i - 2];
        }
        if ((i / 3 >= 10) && (i % 3 == 0)){
            f[i] += f[i / 3];
        }
    }
    cout << f[13] << '\n';
    return 0;
}

/* Исполнитель Июнь16 преобразует число на экране. У исполнителя есть три команды, которым 
присвоены номера: 
1. Прибавить 1 
2. Прибавить 2 
3. Умножить на 3 
Сколько существует программ, для которых при исходном числе 2 результатом является число 13 и при 
этом траектория вычислений содержит число 10? */
