#include <iostream>
#include <vector>
using namespace std;

int main()
{
    int f[29] = { 0 };
    f[1] = 1;

    for (int i = 2; i <= 8; i++) {
        if (i - 1 > 0) {
            f[i] += f[i - 1];
        }
        if (i - 2 > 0) {
            f[i] += f[i - 2];
        }
        if (i % 3 == 0 && i / 3 > 0) {
            f[i] += f[i / 3];
        }
    }

    f[9] = f[8];
    f[10] = 0;
    f[11] = 0;

    for (int i = 12; i <= 28; i++) {
        if (i - 1 >= 8) {
            f[i] += f[i - 1];
        }
        if (i - 2 >= 8) {
            f[i] += f[i - 2];
        }
        if (i % 3 == 0 && i / 3 >= 8) {
            f[i] += f[i / 3];
        }
    }

    cout << f[28] << endl;
    return 0;
}

/*
У исполнителя Калькулятор есть три команды, которым присвоены номера:
1. Прибавить 1 
2. Прибавить 2 
3. Умножить на 3
Сколько существует программ, которые преобразуют исходное число 1 в число 28, 
и при этом траектория вычислений содержит число 8 и не содержит чисел 10 и 11?
*/